      * Variables for Ask for a new value (Text or Numeric): BBSWINASKR
     D wWinMode        S              1A
     D wWinText        S             30A
     D wWinNumber      S              3P 0
     D wWinF3          S               N
      * Variables for Ask Yes/No Windows: BBSWINYNR
     D wConfirmQ       S             15A
     D wConfirmA       S              1A
     D wConfirmF3      S               N
