      * Each User can configure which personal information is shown to
      * other users: Real name, Location, Gender, Birthday, e-mail
     D wUserOptHides   DS
     D  wHideRealName                 1A
     D  wHideLocation                 1A
     D  wHideGender                   1A
     D  wHideEmail                    1A
