     D wDTAARA        UDS                  DTAARA(BBS400DTA)
     D  wSoftVer                      6A
     D  wBBSNAM                      40A
     D  wLOCCRY                       2A
     D  wLOCCTY                      40A
     D  wTIMZON                       3A
     D  wCLOSED                       1A
     D  wNUSLVL                       2A
     D  wNUSSVY                       4A
     D  wMAINTM                       1A
     D  wSHWALD                       1A
     D  wUser                        10A
     D  wUserLvl                      2A
     D  wLvlDescr                    15A
     D  wUserLstLogin                 8A
     D  wLvlAuths                     5A
     D  wNewUsrNtfy                  10A
     D  wHIDESO                       1A
     D  wHLSOMS                       1A
     D wUserLvlAuths   DS
     D  wAuthListUser                 1A
     D  wAuthSysInfor                 1A
     D  wAuthPostMsgs                 1A
     D  wAuthMsgUsers                 1A
     D  wAuthWhosOnli                 1A
