     D wCfgBBSNAM      S             30A
     D wCfgLOCCRY      S              2A
     D wCfgLOCCTY      S             40A
     D wCfgTIMZON      S              3A
     D wCfgCLOSED      S              1A
     D wCfgNUSLVL      S              2P 0
     D wCfgNUSSVY      S              4A
     D wCfgSHWALD      S              1A
     D wCfgSHWWEL      S              1A
     D wCfgNUSRNF      S             10A
     D wCfgHIDESO      S              1A
     D wCfgHLSOMS      S              1A
     D wCfgSurvey      DS
     D  wCfgSvyRName                  1A
     D  wCfgSvyGendr                  1A
     D  wCfgSvyLocat                  1A
     D  wCfgSvyEmail                  1A
